IDEA StatiCa Open Model
ConcreteSLSCheckResultStiffnessEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConcreteSLSCheckResultStiffnessEc2 type exposes the following members.
Properties
Name | Description
Fr
 crack resistance internal forces
 (Inherited from ConcreteSLSCheckResultStiffness.)
CharacteristicsI
 stiffnesses calculated on uncracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
CharacteristicsII
 stiffnesses calculated on cracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
LinearStiffness
 linear stiffnesses
 (Inherited from ConcreteSLSCheckResultStiffness.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Stiffness
 result stiffnesses
 (Inherited from ConcreteSLSCheckResultStiffness.)
StiffnessI
 stiffnesses calculated on uncracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
StiffnessII
 stiffnesses calculated on fully-cracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
Top
See Also
Reference
ConcreteSLSCheckResultStiffnessEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace